### 데이터 병합

- concat, merge
- 데이터 병합 진행

### concat
- axis: 축
- ignore_index: 인덱스를 사용할 것인지, 혹은 새로운 인덱스를 사용할 것인지?

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6]})
df2 = pd.DataFrame({'A':[7,8], 'B':[9,10]})

In [3]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [4]:
df2

   A   B
0  7   9
1  8  10

In [5]:
# axis=0 row 병합
pd.concat([df1, df2], axis=0, ignore_index=True) # 새로운 인덱스 부여

   A   B
0  1   4
1  2   5
2  3   6
3  7   9
4  8  10

In [6]:
pd.concat([df1, df2], axis=0, ignore_index=False) # 원래 인덱스를 그대로 사용

   A   B
0  1   4
1  2   5
2  3   6
0  7   9
1  8  10

In [7]:
pd.concat([df1, df2], axis=1, ignore_index=True) # axis=1 column 병합

   0  1    2     3
0  1  4  7.0   9.0
1  2  5  8.0  10.0
2  3  6  NaN   NaN

In [8]:
pd.concat([df1, df2], axis=1, ignore_index=False)

   A  B    A     B
0  1  4  7.0   9.0
1  2  5  8.0  10.0
2  3  6  NaN   NaN

### merge
- 두 개의 데이터프레임을 조인(join)하는 함수
- 공통된 칼럼을 기준으로 데이터프레임을 병합한다.
- left: 병합할 첫번째 데이터프레임, 왼쪽 데이터프레임
- right: 병합알 두번째 데이터프레임, 오른쪽 데이터프레임
- on: 조인키로 사용할 컬럼 목록, 여기에 입력된 컬럼이 두 데이터프레임에 포함되어야 한다.
- left_on: 왼쪽 데이터프레임에서 조인키로 사용할 컬럼 목록
- right_on: 오른쪽 데이터프레임에서 조인키로 사용할 컬럼 목록
- left_index: 왼쪽 데이터프레임의 조인 기준으로 인덱스를 사용할지?
- right_index: 오른쪽 데이터프레임의 조인 기준으로 인덱스를 사용할지?
- how: 조인방법을 결정, 기본값은 inner

### on

In [9]:
df1 = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6]})
df2 = pd.DataFrame({'A':[1,2,3], 'C':[9,10,11]})

In [10]:
df1

   A  B
0  1  4
1  2  5
2  3  6

In [11]:
df2

   A   C
0  1   9
1  2  10
2  3  11

In [12]:
pd.merge(df1, df2, on='A') # join 키를 A column으로 지정

   A  B   C
0  1  4   9
1  2  5  10
2  3  6  11

In [13]:
df1 = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6]})
df2 = pd.DataFrame({'A':[1,2,4], 'C':[9,10,11]})

In [14]:
pd.merge(df1, df2, on='A') # df1와 df2에 공통으로 들어가는 값만 병합됨

   A  B   C
0  1  4   9
1  2  5  10

### join하고 싶은 컬럼이 2개 이상인 경우?

In [15]:
df1 = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6], 'C':[9,10,11]})
df2 = pd.DataFrame({'A':[1,2,3], 'C':[9,10,11], 'D':[500,600,700]})

In [16]:
df1

   A  B   C
0  1  4   9
1  2  5  10
2  3  6  11

In [17]:
df2

   A   C    D
0  1   9  500
1  2  10  600
2  3  11  700

In [18]:
pd.merge(df1, df2, on=['A','C']) # 공통 컬럼을 지정하고 해당 컬럼의 값이 동일해야한다!

   A  B   C    D
0  1  4   9  500
1  2  5  10  600
2  3  6  11  700

In [19]:
# A의 값은 다 같은데 C는 두 개만 같을 때:
# on의 칼럼의 값이 공통적으로 모두 같아야 한다.
df1 = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6], 'C':[9,10,11]})
df2 = pd.DataFrame({'A':[1,2,3], 'C':[9,10,110], 'D':[500,600,700]})

In [20]:
pd.merge(df1, df2, on=['A','C'])

   A  B   C    D
0  1  4   9  500
1  2  5  10  600

In [21]:
# list 순서를 바꿀 경우
pd.merge(df1, df2, on=['C','A']) # 똑같이 나옴

   A  B   C    D
0  1  4   9  500
1  2  5  10  600

In [22]:
df1 = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6], 'C':[9,10,11]})
df2 = pd.DataFrame({'A':[1,2,3], 'C':[9,10,11], 'D':[500,600,700]})

In [23]:
# list 순서를 바꿀 경우
pd.merge(df1, df2, on=['C','A']) # 똑같이 나옴

   A  B   C    D
0  1  4   9  500
1  2  5  10  600
2  3  6  11  700

### left_on, right_on 인자

In [24]:
df1 = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6], 'C':[9,10,11]})
df2 = pd.DataFrame({'A':[1,2,3], 'C':[9,10,11], 'D':[500,600,700]})

In [25]:
df2.rename({'A':'abc'}, axis=1, inplace=True)

In [26]:
df1

   A  B   C
0  1  4   9
1  2  5  10
2  3  6  11

In [27]:
df2

   abc   C    D
0    1   9  500
1    2  10  600
2    3  11  700

In [28]:
pd.merge(df1, df2, left_on=['A'], right_on=['abc'])

   A  B  C_x  abc  C_y    D
0  1  4    9    1    9  500
1  2  5   10    2   10  600
2  3  6   11    3   11  700

### 두 개 이상의 컬럼을 이용해서 병합을 해보자!

In [29]:
df1 = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6], 'C':[9,10,11]})
df2 = pd.DataFrame({'abc':[1,2,3], 'efg':[9,10,11], 'D':[500,600,700]})

In [30]:
df1

   A  B   C
0  1  4   9
1  2  5  10
2  3  6  11

In [31]:
df2

   abc  efg    D
0    1    9  500
1    2   10  600
2    3   11  700

In [32]:
pd.merge(df1, df2, left_on=['A','C'], right_on=['abc','efg'])

   A  B   C  abc  efg    D
0  1  4   9    1    9  500
1  2  5  10    2   10  600
2  3  6  11    3   11  700

In [33]:
df1 = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6], 'C':[9,10,11]})
df2 = pd.DataFrame({'abc':[1,3,4], 'efg':[9,10,11], 'D':[500,600,700]})

In [34]:
pd.merge(df1, df2, left_on=['A','C'], right_on=['abc','efg'])
# A와 abc 컬럼이 달라져서 결과가 달라짐

   A  B  C  abc  efg    D
0  1  4  9    1    9  500

### left_index, right_index 인자

In [35]:
df1 = pd.DataFrame({'A':[1,2,3], 'B':[4,5,6], 'C':[9,10,11]})
df2 = pd.DataFrame({'abc':[1,3,4], 'efg':[9,10,11], 'D':[500,600,700]})

In [36]:
df1

   A  B   C
0  1  4   9
1  2  5  10
2  3  6  11

In [37]:
df2

   abc  efg    D
0    1    9  500
1    3   10  600
2    4   11  700

In [38]:
df1.set_index('A', inplace=True)

In [39]:
df1

   B   C
A
1  4   9
2  5  10
3  6  11

In [40]:
pd.merge(df1, df2, left_index=True, right_on='abc')

   B   C  abc  efg    D
0  4   9    1    9  500
1  6  11    3   10  600

In [41]:
df1 = pd.DataFrame({'A':[10,20,30], 'B':[4,5,6], 'C':[9,10,11]})
df2 = pd.DataFrame({'abc':[1,3,4], 'efg':[9,10,11], 'D':[500,600,700]})

In [42]:
df1.set_index('A', inplace=True)

In [43]:
df1

    B   C
A
10  4   9
20  5  10
30  6  11

In [44]:
pd.merge(df1, df2, left_index=True, right_on='abc') # index값에 영향을 받음

Empty DataFrame
Columns: [B, C, abc, efg, D]
Index: []

### how
- how: 조인 방법을 설정할 수 있음
- inner - 교집합 개념
- left - 왼쪽 데이터프레임 조인키를 기준으로 병합
- right - 오른쪽 데이터프레임 조인키를 기준으로 병합
- outer - 왼쪽과 오른쪽 데이터프레임의 조인키에 대한 합집합 기준으로 병합

In [45]:
df1 = pd.DataFrame({'A':[1,2,3], 'x':[1,2,3]})
df2 = pd.DataFrame({'A':[2,3,4], 'y':[2,3,4]})

In [46]:
df1

   A  x
0  1  1
1  2  2
2  3  3

In [47]:
df2

   A  y
0  2  2
1  3  3
2  4  4

In [48]:
# how 병합
pd.merge(df1, df2, on='A', how='inner') # 교집합의 개념

   A  x  y
0  2  2  2
1  3  3  3

In [49]:
pd.merge(df1, df2, on='A', how='left') # 왼쪽 기준

   A  x    y
0  1  1  NaN
1  2  2  2.0
2  3  3  3.0

In [50]:
pd.merge(df1, df2, on='A', how='right') # 오른쪽 기준

   A    x  y
0  2  2.0  2
1  3  3.0  3
2  4  NaN  4

In [51]:
pd.merge(df1, df2, on='A', how='outer') # 합집합의 개념

   A    x    y
0  1  1.0  NaN
1  2  2.0  2.0
2  3  3.0  3.0
3  4  NaN  4.0

### 조인키가 두 개일 때 how

In [52]:
df1 = pd.DataFrame({'A':[1,2,3], 'x':[1,2,3], 'c':[10,20,30]})
df2 = pd.DataFrame({'A':[2,3,4], 'x':[2,7,4], 'd':[100,200,300]})

In [53]:
df1

   A  x   c
0  1  1  10
1  2  2  20
2  3  3  30

In [54]:
df2

   A  x    d
0  2  2  100
1  3  7  200
2  4  4  300

In [55]:
pd.merge(df1, df2, on=['A','x'], how='inner')

   A  x   c    d
0  2  2  20  100

In [56]:
pd.merge(df1, df2, on=['A','x'], how='left')

   A  x   c      d
0  1  1  10    NaN
1  2  2  20  100.0
2  3  3  30    NaN

In [57]:
pd.merge(df1, df2, on=['A','x'], how='right')

   A  x     c    d
0  2  2  20.0  100
1  3  7   NaN  200
2  4  4   NaN  300

In [58]:
pd.merge(df1, df2, on=['A','x'], how='outer')

   A  x     c      d
0  1  1  10.0    NaN
1  2  2  20.0  100.0
2  3  3  30.0    NaN
3  3  7   NaN  200.0
4  4  4   NaN  300.0

### 데이터 병합 과제!
- 실제 데이터 프레임을 만들고, 위에 배웠던 내용을 설명과 함께 적어주세요! (주석으로)
- 코드가 작동되면, 아래 코드에 대한 해석을 주석 처리하면 됩니다.
- 컬럼은 최소 3개 이상 병합하는 방법으로 진행해주세요!
- concat: 예시로만 보여주셔도 됩니다! 3개 이상일 필요X